// Generated using ReClass 2016
#include "../Mathtools/mathtools.h"

class playerent;
class boneptr1class;
class boneptr2class;
class healthptr1class;
class healthptr2class;

class playerent
{
public:
	char pad_0x0000[0x8]; //0x0000
	boneptr1class* boneptr1; //0x0008 
	char pad_0x0010[0x64]; //0x0010
	float rotation; //0x0074 
	char pad_0x0078[0x8]; //0x0078
	Vector3 coords; //0x0080 
	char pad_0x008C[0x1834]; //0x008C

}; //Size=0x18C0

class boneptr1class
{
public:
	char pad_0x0000[0x98]; //0x0000
	boneptr2class* boneptr2; //0x0098 
	char pad_0x00A0[0x1F58]; //0x00A0
	healthptr1class* healthptr1; //0x1FF8 
	char pad_0x2000[0x10C]; //0x2000

}; //Size=0x210C

class boneptr2class
{
public:
	char pad_0x0000[0xC]; //0x0000
	float b1_X; //0x000C 
	char pad_0x0010[0xC]; //0x0010
	float b1_Y; //0x001C 
	char pad_0x0020[0xC]; //0x0020
	float b1_Z; //0x002C 
	char pad_0x0030[0xC]; //0x0030
	float b2_X; //0x003C 
	char pad_0x0040[0xC]; //0x0040
	float b2_Y; //0x004C 
	char pad_0x0050[0xC]; //0x0050
	float b2_Z; //0x005C 
	char pad_0x0060[0xC]; //0x0060
	float b3_X; //0x006C 
	char pad_0x0070[0xC]; //0x0070
	float b3_Y; //0x007C 
	char pad_0x0080[0xC]; //0x0080
	float b3_Z; //0x008C 
	char pad_0x0090[0xC]; //0x0090
	float b4_X; //0x009C 
	char pad_0x00A0[0xC]; //0x00A0
	float b4_Y; //0x00AC 
	char pad_0x00B0[0xC]; //0x00B0
	float b4_Z; //0x00BC 
	char pad_0x00C0[0xC]; //0x00C0
	float b5_X; //0x00CC 
	char pad_0x00D0[0xC]; //0x00D0
	float b5_Y; //0x00DC 
	char pad_0x00E0[0xC]; //0x00E0
	float b5_Z; //0x00EC 
	char pad_0x00F0[0xC]; //0x00F0
	float b6_X; //0x00FC 
	char pad_0x0100[0xC]; //0x0100
	float b6_Y; //0x010C 
	char pad_0x0110[0xC]; //0x0110
	float b6_Z; //0x011C 
	char pad_0x0120[0xC]; //0x0120
	float b7_X; //0x012C 
	char pad_0x0130[0xC]; //0x0130
	float b7_Y; //0x013C 
	char pad_0x0140[0xC]; //0x0140
	float b7_Z; //0x014C 
	char pad_0x0150[0xC]; //0x0150
	float b8_X; //0x015C 
	char pad_0x0160[0xC]; //0x0160
	float b8_Y; //0x016C 
	char pad_0x0170[0xC]; //0x0170
	float b8_Z; //0x017C 
	char pad_0x0180[0xC]; //0x0180
	float b9_X; //0x018C 
	char pad_0x0190[0xC]; //0x0190
	float b9_Y; //0x019C 
	char pad_0x01A0[0xC]; //0x01A0
	float b9_Z; //0x01AC 
	char pad_0x01B0[0xC]; //0x01B0
	float b10_X; //0x01BC 
	char pad_0x01C0[0xC]; //0x01C0
	float b10_Y; //0x01CC 
	char pad_0x01D0[0xC]; //0x01D0
	float b10_Z; //0x01DC 
	char pad_0x01E0[0xC]; //0x01E0
	float b11_X; //0x01EC 
	char pad_0x01F0[0xC]; //0x01F0
	float b11_Y; //0x01FC 
	char pad_0x0200[0xC]; //0x0200
	float b11_Z; //0x020C 
	char pad_0x0210[0xC]; //0x0210
	float b12_X; //0x021C 
	char pad_0x0220[0xC]; //0x0220
	float b12_Y; //0x022C 
	char pad_0x0230[0xC]; //0x0230
	float b12_Z; //0x023C 
	char pad_0x0240[0xC]; //0x0240
	float b13_X; //0x024C 
	char pad_0x0250[0xC]; //0x0250
	float b13_Y; //0x025C 
	char pad_0x0260[0xC]; //0x0260
	float b13_Z; //0x026C 
	char pad_0x0270[0xC]; //0x0270
	float b14_X; //0x027C 
	char pad_0x0280[0xC]; //0x0280
	float b14_Y; //0x028C 
	char pad_0x0290[0xC]; //0x0290
	float b14_Z; //0x029C 
	char pad_0x02A0[0xC]; //0x02A0
	float b15_X; //0x02AC 
	char pad_0x02B0[0xC]; //0x02B0
	float b15_Y; //0x02BC 
	char pad_0x02C0[0xC]; //0x02C0
	float b15_Z; //0x02CC 
	char pad_0x02D0[0xC]; //0x02D0
	float b16_X; //0x02DC 
	char pad_0x02E0[0xC]; //0x02E0
	float b16_Y; //0x02EC 
	char pad_0x02F0[0xC]; //0x02F0
	float b16_Z; //0x02FC 
	char pad_0x0300[0xC]; //0x0300
	float b17_X; //0x030C 
	char pad_0x0310[0xC]; //0x0310
	float b17_Y; //0x031C 
	char pad_0x0320[0xC]; //0x0320
	float b17_Z; //0x032C 
	char pad_0x0330[0xC]; //0x0330
	float b18_X; //0x033C 
	char pad_0x0340[0xC]; //0x0340
	float b18_Y; //0x034C 
	char pad_0x0350[0xC]; //0x0350
	float b18_Z; //0x035C 
	char pad_0x0360[0xC]; //0x0360
	float b19_X; //0x036C 
	char pad_0x0370[0xC]; //0x0370
	float b19_Y; //0x037C 
	char pad_0x0380[0xC]; //0x0380
	float b19_Z; //0x038C 
	char pad_0x0390[0xC]; //0x0390
	float b20_X; //0x039C 
	char pad_0x03A0[0xC]; //0x03A0
	float b20_Y; //0x03AC 
	char pad_0x03B0[0xC]; //0x03B0
	float b20_Z; //0x03BC 
	char pad_0x03C0[0xC]; //0x03C0
	float b21_X; //0x03CC 
	char pad_0x03D0[0xC]; //0x03D0
	float b21_Y; //0x03DC 
	char pad_0x03E0[0xC]; //0x03E0
	float b21_Z; //0x03EC 
	char pad_0x03F0[0xC]; //0x03F0
	float b22_X; //0x03FC 
	char pad_0x0400[0xC]; //0x0400
	float b22_Y; //0x040C 
	char pad_0x0410[0xC]; //0x0410
	float b22_Z; //0x041C 
	char pad_0x0420[0xC]; //0x0420
	float b23_X; //0x042C 
	char pad_0x0430[0xC]; //0x0430
	float b23_Y; //0x043C 
	char pad_0x0440[0xC]; //0x0440
	float b23_Z; //0x044C 
	char pad_0x0450[0xC]; //0x0450
	float b24_X; //0x045C 
	char pad_0x0460[0xC]; //0x0460
	float b24_Y; //0x046C 
	char pad_0x0470[0xC]; //0x0470
	float b24_Z; //0x047C 
	char pad_0x0480[0xC]; //0x0480
	float b25_X; //0x048C 
	char pad_0x0490[0xC]; //0x0490
	float b25_Y; //0x049C 
	char pad_0x04A0[0xC]; //0x04A0
	float b25_Z; //0x04AC 
	char pad_0x04B0[0xC]; //0x04B0
	float b26_X; //0x04BC 
	char pad_0x04C0[0xC]; //0x04C0
	float b26_Y; //0x04CC 
	char pad_0x04D0[0xC]; //0x04D0
	float b26_Z; //0x04DC 
	char pad_0x04E0[0xC]; //0x04E0
	float b27_X; //0x04EC 
	char pad_0x04F0[0xC]; //0x04F0
	float b27_Y; //0x04FC 
	char pad_0x0500[0xC]; //0x0500
	float b27_Z; //0x050C 
	char pad_0x0510[0xC]; //0x0510
	float b28_X; //0x051C 
	char pad_0x0520[0xC]; //0x0520
	float b28_Y; //0x052C 
	char pad_0x0530[0xC]; //0x0530
	float b28_Z; //0x053C 
	char pad_0x0540[0xC]; //0x0540
	float b29_X; //0x054C 
	char pad_0x0550[0xC]; //0x0550
	float b29_Y; //0x055C 
	char pad_0x0560[0xC]; //0x0560
	float b29_Z; //0x056C 
	char pad_0x0570[0xC]; //0x0570
	float b30_X; //0x057C 
	char pad_0x0580[0xC]; //0x0580
	float b30_Y; //0x058C 
	char pad_0x0590[0xC]; //0x0590
	float b30_Z; //0x059C 
	char pad_0x05A0[0xC]; //0x05A0
	float b31_X; //0x05AC 
	char pad_0x05B0[0xC]; //0x05B0
	float b31_Y; //0x05BC 
	char pad_0x05C0[0xC]; //0x05C0
	float b31_Z; //0x05CC 
	char pad_0x05D0[0xC]; //0x05D0
	float b32_X; //0x05DC 
	char pad_0x05E0[0xC]; //0x05E0
	float b32_Y; //0x05EC 
	char pad_0x05F0[0xC]; //0x05F0
	float b32_Z; //0x05FC 
	char pad_0x0600[0xC]; //0x0600
	float b33_X; //0x060C 
	char pad_0x0610[0xC]; //0x0610
	float b33_Y; //0x061C 
	char pad_0x0620[0xC]; //0x0620
	float b33_Z; //0x062C 
	char pad_0x0630[0xC]; //0x0630
	float b34_X; //0x063C 
	char pad_0x0640[0xC]; //0x0640
	float b34_Y; //0x064C 
	char pad_0x0650[0xC]; //0x0650
	float b34_Z; //0x065C 
	char pad_0x0660[0xC]; //0x0660
	float b35_X; //0x066C 
	char pad_0x0670[0xC]; //0x0670
	float b35_Y; //0x067C 
	char pad_0x0680[0xC]; //0x0680
	float b35_Z; //0x068C 
	char pad_0x0690[0xC]; //0x0690
	float b36_X; //0x069C 
	char pad_0x06A0[0xC]; //0x06A0
	float b36_Y; //0x06AC 
	char pad_0x06B0[0xC]; //0x06B0
	float b36_Z; //0x06BC 
	char pad_0x06C0[0xC]; //0x06C0
	float b37_X; //0x06CC 
	char pad_0x06D0[0xC]; //0x06D0
	float b37_Y; //0x06DC 
	char pad_0x06E0[0xC]; //0x06E0
	float b37_Z; //0x06EC 
	char pad_0x06F0[0xC]; //0x06F0
	float b38_X; //0x06FC 
	char pad_0x0700[0xC]; //0x0700
	float b38_Y; //0x070C 
	char pad_0x0710[0xC]; //0x0710
	float b38_Z; //0x071C 
	char pad_0x0720[0xC]; //0x0720
	float b39_X; //0x072C 
	char pad_0x0730[0xC]; //0x0730
	float b39_Y; //0x073C 
	char pad_0x0740[0xC]; //0x0740
	float b39_Z; //0x074C 
	char pad_0x0750[0xC]; //0x0750
	float b40_X; //0x075C 
	char pad_0x0760[0xC]; //0x0760
	float b40_Y; //0x076C 
	char pad_0x0770[0xC]; //0x0770
	float b40_Z; //0x077C 
	char pad_0x0780[0xC]; //0x0780
	float b41_X; //0x078C 
	char pad_0x0790[0xC]; //0x0790
	float b41_Y; //0x079C 
	char pad_0x07A0[0xC]; //0x07A0
	float b41_Z; //0x07AC 
	char pad_0x07B0[0xC]; //0x07B0
	float b41f_X; //0x07BC 
	char pad_0x07C0[0xC]; //0x07C0
	float b41f_Y; //0x07CC 
	char pad_0x07D0[0xC]; //0x07D0
	float b41f_Z; //0x07DC 
	char pad_0x07E0[0xC]; //0x07E0
	float b42_X; //0x07EC 
	char pad_0x07F0[0xC]; //0x07F0
	float b42_Y; //0x07FC 
	char pad_0x0800[0xC]; //0x0800
	float b42_Z; //0x080C 
	char pad_0x0810[0xC]; //0x0810
	float b43_X; //0x081C 
	char pad_0x0820[0xC]; //0x0820
	float b43_Y; //0x082C 
	char pad_0x0830[0xC]; //0x0830
	float b43_Z; //0x083C 
	char pad_0x0840[0xC]; //0x0840
	float b44_X; //0x084C 
	char pad_0x0850[0xC]; //0x0850
	float b44_Y; //0x085C 
	char pad_0x0860[0xC]; //0x0860
	float b44_Z; //0x086C 
	char pad_0x0870[0xC]; //0x0870
	float b45_X; //0x087C 
	char pad_0x0880[0xC]; //0x0880
	float b45_Y; //0x088C 
	char pad_0x0890[0xC]; //0x0890
	float b45_Z; //0x089C 
	char pad_0x08A0[0xC]; //0x08A0
	float b46_X; //0x08AC 
	char pad_0x08B0[0xC]; //0x08B0
	float b46_Y; //0x08BC 
	char pad_0x08C0[0xC]; //0x08C0
	float b46_Z; //0x08CC 
	char pad_0x08D0[0xC]; //0x08D0
	float b47_X; //0x08DC 
	char pad_0x08E0[0xC]; //0x08E0
	float b47_Y; //0x08EC 
	char pad_0x08F0[0xC]; //0x08F0
	float b47_Z; //0x08FC 
	char pad_0x0900[0xC]; //0x0900
	float b48_X; //0x090C 
	char pad_0x0910[0xC]; //0x0910
	float b48_Y; //0x091C 
	char pad_0x0920[0xC]; //0x0920
	float b48_Z; //0x092C 
	char pad_0x0930[0xC]; //0x0930
	float b49_X; //0x093C 
	char pad_0x0940[0xC]; //0x0940
	float b49_Y; //0x094C 
	char pad_0x0950[0xC]; //0x0950
	float b49_Z; //0x095C 
	char pad_0x0960[0xC]; //0x0960
	float b50_X; //0x096C 
	char pad_0x0970[0xC]; //0x0970
	float b50_Y; //0x097C 
	char pad_0x0980[0xC]; //0x0980
	float b50_Z; //0x098C 
	char pad_0x0990[0xC]; //0x0990
	float b51_X; //0x099C 
	char pad_0x09A0[0xC]; //0x09A0
	float b51_Y; //0x09AC 
	char pad_0x09B0[0xC]; //0x09B0
	float b51_Z; //0x09BC 
	char pad_0x09C0[0xC]; //0x09C0
	float b52_X; //0x09CC 
	char pad_0x09D0[0xC]; //0x09D0
	float b52_Y; //0x09DC 
	char pad_0x09E0[0xC]; //0x09E0
	float b52_Z; //0x09EC 
	char pad_0x09F0[0xC]; //0x09F0
	float b53_X; //0x09FC 
	char pad_0x0A00[0xC]; //0x0A00
	float b53_Y; //0x0A0C 
	char pad_0x0A10[0xC]; //0x0A10
	float b53_Z; //0x0A1C 
	char pad_0x0A20[0xC]; //0x0A20
	float b54_X; //0x0A2C 
	char pad_0x0A30[0xC]; //0x0A30
	float b54_Y; //0x0A3C 
	char pad_0x0A40[0xC]; //0x0A40
	float b54_Z; //0x0A4C 
	char pad_0x0A50[0xC]; //0x0A50
	float b55_X; //0x0A5C 
	char pad_0x0A60[0xC]; //0x0A60
	float b55_Y; //0x0A6C 
	char pad_0x0A70[0xC]; //0x0A70
	float b55_Z; //0x0A7C 
	char pad_0x0A80[0xC]; //0x0A80
	float b56_X; //0x0A8C 
	char pad_0x0A90[0xC]; //0x0A90
	float b56_Y; //0x0A9C 
	char pad_0x0AA0[0xC]; //0x0AA0
	float b56_Z; //0x0AAC 
	char pad_0x0AB0[0xC]; //0x0AB0
	float b57_X; //0x0ABC 
	char pad_0x0AC0[0xC]; //0x0AC0
	float b57_Y; //0x0ACC 
	char pad_0x0AD0[0xC]; //0x0AD0
	float b57_Z; //0x0ADC 
	char pad_0x0AE0[0xC]; //0x0AE0
	float b58_X; //0x0AEC 
	char pad_0x0AF0[0xC]; //0x0AF0
	float b58_Y; //0x0AFC 
	char pad_0x0B00[0xC]; //0x0B00
	float b58_Z; //0x0B0C 
	char pad_0x0B10[0xC]; //0x0B10
	float b59_X; //0x0B1C 
	char pad_0x0B20[0xC]; //0x0B20
	float b59_Y; //0x0B2C 
	char pad_0x0B30[0xC]; //0x0B30
	float b59_Z; //0x0B3C 
	char pad_0x0B40[0xC]; //0x0B40
	float b60_X; //0x0B4C 
	char pad_0x0B50[0xC]; //0x0B50
	float b60_Y; //0x0B5C 
	char pad_0x0B60[0xC]; //0x0B60
	float b60_Z; //0x0B6C 
	char pad_0x0B70[0xC]; //0x0B70
	float b61_X; //0x0B7C 
	char pad_0x0B80[0xC]; //0x0B80
	float b61_Y; //0x0B8C 
	char pad_0x0B90[0xC]; //0x0B90
	float b61_Z; //0x0B9C 
	char pad_0x0BA0[0xC]; //0x0BA0
	float b62_X; //0x0BAC 
	char pad_0x0BB0[0xC]; //0x0BB0
	float b62_Y; //0x0BBC 
	char pad_0x0BC0[0xC]; //0x0BC0
	float b62_Z; //0x0BCC 
	char pad_0x0BD0[0xC]; //0x0BD0
	float b63_X; //0x0BDC 
	char pad_0x0BE0[0xC]; //0x0BE0
	float b63_Y; //0x0BEC 
	char pad_0x0BF0[0xC]; //0x0BF0
	float b63_Z; //0x0BFC 
	char pad_0x0C00[0xC]; //0x0C00
	float b64_X; //0x0C0C 
	char pad_0x0C10[0xC]; //0x0C10
	float b64_Y; //0x0C1C 
	char pad_0x0C20[0xC]; //0x0C20
	float b64_Z; //0x0C2C 
	char pad_0x0C30[0xC]; //0x0C30
	float b65_X; //0x0C3C 
	char pad_0x0C40[0xC]; //0x0C40
	float b65_Y; //0x0C4C 
	char pad_0x0C50[0xC]; //0x0C50
	float b65_Z; //0x0C5C 
	char pad_0x0C60[0xC]; //0x0C60
	float b66_X; //0x0C6C 
	char pad_0x0C70[0xC]; //0x0C70
	float b66_Y; //0x0C7C 
	char pad_0x0C80[0xC]; //0x0C80
	float b66_Z; //0x0C8C 
	char pad_0x0C90[0xC]; //0x0C90
	float b67_X; //0x0C9C 
	char pad_0x0CA0[0xC]; //0x0CA0
	float b67_Y; //0x0CAC 
	char pad_0x0CB0[0xC]; //0x0CB0
	float b67_Z; //0x0CBC 
	char pad_0x0CC0[0xC]; //0x0CC0
	float b68_X; //0x0CCC 
	char pad_0x0CD0[0xC]; //0x0CD0
	float b68_Y; //0x0CDC 
	char pad_0x0CE0[0xC]; //0x0CE0
	float b68_Z; //0x0CEC 
	char pad_0x0CF0[0xC]; //0x0CF0
	float b69_X; //0x0CFC 
	char pad_0x0D00[0xC]; //0x0D00
	float b69_Y; //0x0D0C 
	char pad_0x0D10[0xC]; //0x0D10
	float b69_Z; //0x0D1C 
	char pad_0x0D20[0xC]; //0x0D20
	float b70_X; //0x0D2C 
	char pad_0x0D30[0xC]; //0x0D30
	float b70_Y; //0x0D3C 
	char pad_0x0D40[0xC]; //0x0D40
	float b70_Z; //0x0D4C 
	char pad_0x0D50[0xC]; //0x0D50
	float b71_X; //0x0D5C 
	char pad_0x0D60[0xC]; //0x0D60
	float b71_Y; //0x0D6C 
	char pad_0x0D70[0xC]; //0x0D70
	float b71_Z; //0x0D7C 
	char pad_0x0D80[0xC]; //0x0D80
	float b72_X; //0x0D8C 
	char pad_0x0D90[0xC]; //0x0D90
	float b72_Y; //0x0D9C 
	char pad_0x0DA0[0xC]; //0x0DA0
	float b72_Z; //0x0DAC 
	char pad_0x0DB0[0xC]; //0x0DB0
	float b73_X; //0x0DBC 
	char pad_0x0DC0[0xC]; //0x0DC0
	float b73_Y; //0x0DCC 
	char pad_0x0DD0[0xC]; //0x0DD0
	float b73_Z; //0x0DDC 
	char pad_0x0DE0[0xC]; //0x0DE0
	float b74_X; //0x0DEC 
	char pad_0x0DF0[0xC]; //0x0DF0
	float b74_Y; //0x0DFC 
	char pad_0x0E00[0xC]; //0x0E00
	float b74_Z; //0x0E0C 
	char pad_0x0E10[0xC]; //0x0E10
	float b75_X; //0x0E1C 
	char pad_0x0E20[0xC]; //0x0E20
	float b75_Y; //0x0E2C 
	char pad_0x0E30[0xC]; //0x0E30
	float b75_Z; //0x0E3C 
	char pad_0x0E40[0xC]; //0x0E40
	float b76_X; //0x0E4C 
	char pad_0x0E50[0xC]; //0x0E50
	float b76_Y; //0x0E5C 
	char pad_0x0E60[0xC]; //0x0E60
	float b76_Z; //0x0E6C 
	char pad_0x0E70[0xC]; //0x0E70
	float b77_X; //0x0E7C 
	char pad_0x0E80[0xC]; //0x0E80
	float b77_Y; //0x0E8C 
	char pad_0x0E90[0xC]; //0x0E90
	float b77_Z; //0x0E9C 
	char pad_0x0EA0[0xC]; //0x0EA0
	float b78_X; //0x0EAC 
	char pad_0x0EB0[0xC]; //0x0EB0
	float b78_Y; //0x0EBC 
	char pad_0x0EC0[0xC]; //0x0EC0
	float b78_Z; //0x0ECC 
	char pad_0x0ED0[0xC]; //0x0ED0
	float b79_X; //0x0EDC 
	char pad_0x0EE0[0xC]; //0x0EE0
	float b79_Y; //0x0EEC 
	char pad_0x0EF0[0xC]; //0x0EF0
	float b79_Z; //0x0EFC 
	char pad_0x0F00[0xC]; //0x0F00
	float b80_X; //0x0F0C 
	char pad_0x0F10[0xC]; //0x0F10
	float b80_Y; //0x0F1C 
	char pad_0x0F20[0xC]; //0x0F20
	float b80_Z; //0x0F2C 
	char pad_0x0F30[0xC]; //0x0F30
	float b81_X; //0x0F3C 
	char pad_0x0F40[0xC]; //0x0F40
	float b81_Y; //0x0F4C 
	char pad_0x0F50[0xC]; //0x0F50
	float b81_Z; //0x0F5C 
	char pad_0x0F60[0xC]; //0x0F60
	float b82_X; //0x0F6C 
	char pad_0x0F70[0xC]; //0x0F70
	float b82_Y; //0x0F7C 
	char pad_0x0F80[0xC]; //0x0F80
	float b82_Z; //0x0F8C 
	char pad_0x0F90[0xC]; //0x0F90
	float b83_X; //0x0F9C 
	char pad_0x0FA0[0xC]; //0x0FA0
	float b83_Y; //0x0FAC 
	char pad_0x0FB0[0xC]; //0x0FB0
	float b83_Z; //0x0FBC 
	char pad_0x0FC0[0xC]; //0x0FC0
	float b84_X; //0x0FCC 
	char pad_0x0FD0[0xC]; //0x0FD0
	float b84_Y; //0x0FDC 
	char pad_0x0FE0[0xC]; //0x0FE0
	float b84_Z; //0x0FEC 
	char pad_0x0FF0[0xC]; //0x0FF0
	float b85_X; //0x0FFC 
	char pad_0x1000[0xC]; //0x1000
	float b85_Y; //0x100C 
	char pad_0x1010[0xC]; //0x1010
	float b85_Z; //0x101C 
	char pad_0x1020[0xC]; //0x1020
	float b86_X; //0x102C 
	char pad_0x1030[0xC]; //0x1030
	float b86_Y; //0x103C 
	char pad_0x1040[0xC]; //0x1040
	float b86_Z; //0x104C 
	char pad_0x1050[0xC]; //0x1050
	float b87_X; //0x105C 
	char pad_0x1060[0xC]; //0x1060
	float b87_Y; //0x106C 
	char pad_0x1070[0xC]; //0x1070
	float b87_Z; //0x107C 
	char pad_0x1080[0xC]; //0x1080
	float b88_X; //0x108C 
	char pad_0x1090[0xC]; //0x1090
	float b88_Y; //0x109C 
	char pad_0x10A0[0xC]; //0x10A0
	float b88_Z; //0x10AC 
	char pad_0x10B0[0xC]; //0x10B0
	float b89_X; //0x10BC 
	char pad_0x10C0[0xC]; //0x10C0
	float b89_Y; //0x10CC 
	char pad_0x10D0[0xC]; //0x10D0
	float b89_Z; //0x10DC 
	char pad_0x10E0[0xC]; //0x10E0
	float b90_X; //0x10EC 
	char pad_0x10F0[0xC]; //0x10F0
	float b90_Y; //0x10FC 
	char pad_0x1100[0xC]; //0x1100
	float b90_Z; //0x110C 
	char pad_0x1110[0xC]; //0x1110
	float b91_X; //0x111C 
	char pad_0x1120[0xC]; //0x1120
	float b91_Y; //0x112C 
	char pad_0x1130[0xC]; //0x1130
	float b91_Z; //0x113C 
	char pad_0x1140[0xC]; //0x1140
	float b91f_X; //0x114C 
	char pad_0x1150[0xC]; //0x1150
	float b91f_Y; //0x115C 
	char pad_0x1160[0xC]; //0x1160
	float b91f_Z; //0x116C 
	char pad_0x1170[0xC]; //0x1170
	float b92_X; //0x117C 
	char pad_0x1180[0xC]; //0x1180
	float b92_Y; //0x118C 
	char pad_0x1190[0xC]; //0x1190
	float b92_Z; //0x119C 
	char pad_0x11A0[0xC]; //0x11A0
	float b93_X; //0x11AC 
	char pad_0x11B0[0xC]; //0x11B0
	float b93_Y; //0x11BC 
	char pad_0x11C0[0xC]; //0x11C0
	float b93_Z; //0x11CC 
	char pad_0x11D0[0xC]; //0x11D0
	float b94_X; //0x11DC 
	char pad_0x11E0[0xC]; //0x11E0
	float b94_Y; //0x11EC 
	char pad_0x11F0[0xC]; //0x11F0
	float b94_Z; //0x11FC 
	char pad_0x1200[0xC]; //0x1200
	float b95_X; //0x120C 
	char pad_0x1210[0xC]; //0x1210
	float b95_Y; //0x121C 
	char pad_0x1220[0xC]; //0x1220
	float b95_Z; //0x122C 
	char pad_0x1230[0xC]; //0x1230
	float b96_X; //0x123C 
	char pad_0x1240[0xC]; //0x1240
	float b96_Y; //0x124C 
	char pad_0x1250[0xC]; //0x1250
	float b96_Z; //0x125C 
	char pad_0x1260[0xC]; //0x1260
	float b97_X; //0x126C 
	char pad_0x1270[0xC]; //0x1270
	float b97_Y; //0x127C 
	char pad_0x1280[0xC]; //0x1280
	float b97_Z; //0x128C 
	char pad_0x1290[0xC]; //0x1290
	float b98_X; //0x129C 
	char pad_0x12A0[0xC]; //0x12A0
	float b98_Y; //0x12AC 
	char pad_0x12B0[0xC]; //0x12B0
	float b98_Z; //0x12BC 
	char pad_0x12C0[0xC]; //0x12C0
	float b99_X; //0x12CC 
	char pad_0x12D0[0xC]; //0x12D0
	float b99_Y; //0x12DC 
	char pad_0x12E0[0xC]; //0x12E0
	float b99_Z; //0x12EC 
	char pad_0x12F0[0xC]; //0x12F0
	float b100_X; //0x12FC 
	char pad_0x1300[0xC]; //0x1300
	float b100_Y; //0x130C 
	char pad_0x1310[0xC]; //0x1310
	float b100_Z; //0x131C 
	char pad_0x1320[0xC]; //0x1320
	float b101_X; //0x132C 
	char pad_0x1330[0xC]; //0x1330
	float b101_Y; //0x133C 
	char pad_0x1340[0xC]; //0x1340
	float b101_Z; //0x134C 
	char pad_0x1350[0xC]; //0x1350
	float b102_X; //0x135C 
	char pad_0x1360[0xC]; //0x1360
	float b102_Y; //0x136C 
	char pad_0x1370[0xC]; //0x1370
	float b102_Z; //0x137C 
	char pad_0x1380[0xC]; //0x1380
	float b103_X; //0x138C 
	char pad_0x1390[0xC]; //0x1390
	float b103_Y; //0x139C 
	char pad_0x13A0[0xC]; //0x13A0
	float b103_Z; //0x13AC 
	char pad_0x13B0[0xC]; //0x13B0
	float b104_X; //0x13BC 
	char pad_0x13C0[0xC]; //0x13C0
	float b104_Y; //0x13CC 
	char pad_0x13D0[0xC]; //0x13D0
	float b104_Z; //0x13DC 
	char pad_0x13E0[0xC]; //0x13E0
	float b105_X; //0x13EC 
	char pad_0x13F0[0xC]; //0x13F0
	float b105_Y; //0x13FC 
	char pad_0x1400[0xC]; //0x1400
	float b105_Z; //0x140C 
	char pad_0x1410[0xC]; //0x1410
	float b106_X; //0x141C 
	char pad_0x1420[0xC]; //0x1420
	float b106_Y; //0x142C 
	char pad_0x1430[0xC]; //0x1430
	float b106_Z; //0x143C 
	char pad_0x1440[0xC]; //0x1440
	float b107_X; //0x144C 
	char pad_0x1450[0xC]; //0x1450
	float b107_Y; //0x145C 
	char pad_0x1460[0xC]; //0x1460
	float b107_Z; //0x146C 
	char pad_0x1470[0xC]; //0x1470
	float b108_X; //0x147C 
	char pad_0x1480[0xC]; //0x1480
	float b108_Y; //0x148C 
	char pad_0x1490[0xC]; //0x1490
	float b108_Z; //0x149C 
	char pad_0x14A0[0xC]; //0x14A0
	float b109_X; //0x14AC 
	char pad_0x14B0[0xC]; //0x14B0
	float b109_Y; //0x14BC 
	char pad_0x14C0[0xC]; //0x14C0
	float b109_Z; //0x14CC 
	char pad_0x14D0[0xC]; //0x14D0
	float b110_X; //0x14DC 
	char pad_0x14E0[0xC]; //0x14E0
	float b110_Y; //0x14EC 
	char pad_0x14F0[0xC]; //0x14F0
	float b110_Z; //0x14FC 
	char pad_0x1500[0xC]; //0x1500
	float b111_X; //0x150C 
	char pad_0x1510[0xC]; //0x1510
	float b111_Y; //0x151C 
	char pad_0x1520[0xC]; //0x1520
	float b111_Z; //0x152C 
	char pad_0x1530[0xC]; //0x1530
	float b112_X; //0x153C 
	char pad_0x1540[0xC]; //0x1540
	float b112_Y; //0x154C 
	char pad_0x1550[0xC]; //0x1550
	float b112_Z; //0x155C 
	char pad_0x1560[0xC]; //0x1560
	float b113_X; //0x156C 
	char pad_0x1570[0xC]; //0x1570
	float b113_Y; //0x157C 
	char pad_0x1580[0xC]; //0x1580
	float b113_Z; //0x158C 
	char pad_0x1590[0xC]; //0x1590
	float b114_X; //0x159C 
	char pad_0x15A0[0xC]; //0x15A0
	float b114_Y; //0x15AC 
	char pad_0x15B0[0xC]; //0x15B0
	float b114_Z; //0x15BC 
	char pad_0x15C0[0xC]; //0x15C0
	float b115_X; //0x15CC 
	char pad_0x15D0[0xC]; //0x15D0
	float b115_Y; //0x15DC 
	char pad_0x15E0[0xC]; //0x15E0
	float b115_Z; //0x15EC 
	char pad_0x15F0[0xC]; //0x15F0
	float b116_X; //0x15FC 
	char pad_0x1600[0xC]; //0x1600
	float b116_Y; //0x160C 
	char pad_0x1610[0xC]; //0x1610
	float b116_Z; //0x161C 
	char pad_0x1620[0xC]; //0x1620
	float b117_X; //0x162C 
	char pad_0x1630[0xC]; //0x1630
	float b117_Y; //0x163C 
	char pad_0x1640[0xC]; //0x1640
	float b117_Z; //0x164C 
	char pad_0x1650[0xC]; //0x1650
	float b118_X; //0x165C 
	char pad_0x1660[0xC]; //0x1660
	float b118_Y; //0x166C 
	char pad_0x1670[0xC]; //0x1670
	float b118_Z; //0x167C 
	char pad_0x1680[0xC]; //0x1680
	float b119_X; //0x168C 
	char pad_0x1690[0xC]; //0x1690
	float b119_Y; //0x169C 
	char pad_0x16A0[0xC]; //0x16A0
	float b119_Z; //0x16AC 
	char pad_0x16B0[0xC]; //0x16B0
	float b120_X; //0x16BC 
	char pad_0x16C0[0xC]; //0x16C0
	float b120_Y; //0x16CC 
	char pad_0x16D0[0xC]; //0x16D0
	float b120_Z; //0x16DC 
	char pad_0x16E0[0xC]; //0x16E0
	float b121_X; //0x16EC 
	char pad_0x16F0[0xC]; //0x16F0
	float b121_Y; //0x16FC 
	char pad_0x1700[0xC]; //0x1700
	float b121_Z; //0x170C 
	char pad_0x1710[0xC]; //0x1710
	float b122_X; //0x171C 
	char pad_0x1720[0xC]; //0x1720
	float b122_Y; //0x172C 
	char pad_0x1730[0xC]; //0x1730
	float b122_Z; //0x173C 
	char pad_0x1740[0xC]; //0x1740
	float b123_X; //0x174C 
	char pad_0x1750[0xC]; //0x1750
	float b123_Y; //0x175C 
	char pad_0x1760[0xC]; //0x1760
	float b123_Z; //0x176C 
	char pad_0x1770[0xC]; //0x1770
	float b124_X; //0x177C 
	char pad_0x1780[0xC]; //0x1780
	float b124_Y; //0x178C 
	char pad_0x1790[0xC]; //0x1790
	float b124_Z; //0x179C 
	char pad_0x17A0[0xC]; //0x17A0
	float b125_X; //0x17AC 
	char pad_0x17B0[0xC]; //0x17B0
	float b125_Y; //0x17BC 
	char pad_0x17C0[0xC]; //0x17C0
	float b125_Z; //0x17CC 
	char pad_0x17D0[0xC]; //0x17D0
	float b126_X; //0x17DC 
	char pad_0x17E0[0xC]; //0x17E0
	float b126_Y; //0x17EC 
	char pad_0x17F0[0xC]; //0x17F0
	float b126_Z; //0x17FC 
	char pad_0x1800[0xC]; //0x1800
	float b127_X; //0x180C 
	char pad_0x1810[0xC]; //0x1810
	float b127_Y; //0x181C 
	char pad_0x1820[0xC]; //0x1820
	float b127_Z; //0x182C 
	char pad_0x1830[0xC]; //0x1830
	float b128_X; //0x183C 
	char pad_0x1840[0xC]; //0x1840
	float b128_Y; //0x184C 
	char pad_0x1850[0xC]; //0x1850
	float b128_Z; //0x185C 
	char pad_0x1860[0xC]; //0x1860
	float b129_X; //0x186C 
	char pad_0x1870[0xC]; //0x1870
	float b129_Y; //0x187C 
	char pad_0x1880[0xC]; //0x1880
	float b129_Z; //0x188C 
	char pad_0x1890[0xC]; //0x1890
	float b130_X; //0x189C 
	char pad_0x18A0[0xC]; //0x18A0
	float b130_Y; //0x18AC 
	char pad_0x18B0[0xC]; //0x18B0
	float b130_Z; //0x18BC 
	char pad_0x18C0[0xC]; //0x18C0
	float b131_X; //0x18CC 
	char pad_0x18D0[0xC]; //0x18D0
	float b131_Y; //0x18DC 
	char pad_0x18E0[0xC]; //0x18E0
	float b131_Z; //0x18EC 
	char pad_0x18F0[0xC]; //0x18F0
	float b132_X; //0x18FC 
	char pad_0x1900[0xC]; //0x1900
	float b132_Y; //0x190C 
	char pad_0x1910[0xC]; //0x1910
	float b132_Z; //0x191C 
	char pad_0x1920[0xC]; //0x1920
	float b133_X; //0x192C 
	char pad_0x1930[0xC]; //0x1930
	float b133_Y; //0x193C 
	char pad_0x1940[0xC]; //0x1940
	float b133_Z; //0x194C 
	char pad_0x1950[0xC]; //0x1950
	float b134_X; //0x195C 
	char pad_0x1960[0xC]; //0x1960
	float b134_Y; //0x196C 
	char pad_0x1970[0xC]; //0x1970
	float b134_Z; //0x197C 
	char pad_0x1980[0xC]; //0x1980
	float b135_X; //0x198C 
	char pad_0x1990[0xC]; //0x1990
	float b135_Y; //0x199C 
	char pad_0x19A0[0xC]; //0x19A0
	float b135_Z; //0x19AC 
	char pad_0x19B0[0xC]; //0x19B0
	float b136_X; //0x19BC 
	char pad_0x19C0[0xC]; //0x19C0
	float b136_Y; //0x19CC 
	char pad_0x19D0[0xC]; //0x19D0
	float b136_Z; //0x19DC 
	char pad_0x19E0[0xC]; //0x19E0
	float b137_X; //0x19EC 
	char pad_0x19F0[0xC]; //0x19F0
	float b137_Y; //0x19FC 
	char pad_0x1A00[0xC]; //0x1A00
	float b137_Z; //0x1A0C 
	char pad_0x1A10[0xC]; //0x1A10
	float b138_X; //0x1A1C 
	char pad_0x1A20[0xC]; //0x1A20
	float b138_Y; //0x1A2C 
	char pad_0x1A30[0xC]; //0x1A30
	float b138_Z; //0x1A3C 
	char pad_0x1A40[0xC]; //0x1A40
	float b139_X; //0x1A4C 
	char pad_0x1A50[0xC]; //0x1A50
	float b139_Y; //0x1A5C 
	char pad_0x1A60[0xC]; //0x1A60
	float b139_Z; //0x1A6C 
	char pad_0x1A70[0xC]; //0x1A70
	float b140_X; //0x1A7C 
	char pad_0x1A80[0xC]; //0x1A80
	float b140_Y; //0x1A8C 
	char pad_0x1A90[0xC]; //0x1A90
	float b140_Z; //0x1A9C 
	char pad_0x1AA0[0xC]; //0x1AA0
	float b141_X; //0x1AAC 
	char pad_0x1AB0[0xC]; //0x1AB0
	float b141_Y; //0x1ABC 
	char pad_0x1AC0[0xC]; //0x1AC0
	float b141_Z; //0x1ACC 
	char pad_0x1AD0[0xC]; //0x1AD0
	float b142_X; //0x1ADC 
	char pad_0x1AE0[0xC]; //0x1AE0
	float b142_Y; //0x1AEC 
	char pad_0x1AF0[0xC]; //0x1AF0
	float b142_Z; //0x1AFC 
	char pad_0x1B00[0xC]; //0x1B00
	float b143_X; //0x1B0C 
	char pad_0x1B10[0xC]; //0x1B10
	float b143_Y; //0x1B1C 
	char pad_0x1B20[0xC]; //0x1B20
	float b143_Z; //0x1B2C 
	char pad_0x1B30[0xC]; //0x1B30
	float b144_X; //0x1B3C 
	char pad_0x1B40[0xC]; //0x1B40
	float b144_Y; //0x1B4C 
	char pad_0x1B50[0xC]; //0x1B50
	float b144_Z; //0x1B5C 
	char pad_0x1B60[0xC]; //0x1B60
	float b145_X; //0x1B6C 
	char pad_0x1B70[0xC]; //0x1B70
	float b145_Y; //0x1B7C 
	char pad_0x1B80[0xC]; //0x1B80
	float b145_Z; //0x1B8C 
	char pad_0x1B90[0xC]; //0x1B90
	float b146_X; //0x1B9C 
	char pad_0x1BA0[0xC]; //0x1BA0
	float b146_Y; //0x1BAC 
	char pad_0x1BB0[0xC]; //0x1BB0
	float b146_Z; //0x1BBC 
	char pad_0x1BC0[0xC]; //0x1BC0
	float b147_X; //0x1BCC 
	char pad_0x1BD0[0xC]; //0x1BD0
	float b147_Y; //0x1BDC 
	char pad_0x1BE0[0xC]; //0x1BE0
	float b147_Z; //0x1BEC 
	char pad_0x1BF0[0xC]; //0x1BF0
	float b148_X; //0x1BFC 
	char pad_0x1C00[0xC]; //0x1C00
	float b148_Y; //0x1C0C 
	char pad_0x1C10[0xC]; //0x1C10
	float b148_Z; //0x1C1C 
	char pad_0x1C20[0xC]; //0x1C20
	float b149_X; //0x1C2C 
	char pad_0x1C30[0xC]; //0x1C30
	float b149_Y; //0x1C3C 
	char pad_0x1C40[0xC]; //0x1C40
	float b149_Z; //0x1C4C 
	char pad_0x1C50[0xC]; //0x1C50
	float b150_X; //0x1C5C 
	char pad_0x1C60[0xC]; //0x1C60
	float b150_Y; //0x1C6C 
	char pad_0x1C70[0xC]; //0x1C70
	float b150_Z; //0x1C7C 
	char pad_0x1C80[0xC]; //0x1C80
	float b151_X; //0x1C8C 
	char pad_0x1C90[0xC]; //0x1C90
	float b151_Y; //0x1C9C 
	char pad_0x1CA0[0xC]; //0x1CA0
	float b151_Z; //0x1CAC 
	char pad_0x1CB0[0xC]; //0x1CB0
	float b152_X; //0x1CBC 
	char pad_0x1CC0[0xC]; //0x1CC0
	float b152_Y; //0x1CCC 
	char pad_0x1CD0[0xC]; //0x1CD0
	float b152_Z; //0x1CDC 
	char pad_0x1CE0[0xC]; //0x1CE0
	float b153_X; //0x1CEC 
	char pad_0x1CF0[0xC]; //0x1CF0
	float b153_Y; //0x1CFC 
	char pad_0x1D00[0xC]; //0x1D00
	float b153_Z; //0x1D0C 
	char pad_0x1D10[0xC]; //0x1D10
	float b154_X; //0x1D1C 
	char pad_0x1D20[0xC]; //0x1D20
	float b154_Y; //0x1D2C 
	char pad_0x1D30[0xC]; //0x1D30
	float b154_Z; //0x1D3C 
	char pad_0x1D40[0xC]; //0x1D40
	float b155_X; //0x1D4C 
	char pad_0x1D50[0xC]; //0x1D50
	float b155_Y; //0x1D5C 
	char pad_0x1D60[0xC]; //0x1D60
	float b155_Z; //0x1D6C 
	char pad_0x1D70[0xC]; //0x1D70
	float b156_X; //0x1D7C 
	char pad_0x1D80[0xC]; //0x1D80
	float b156_Y; //0x1D8C 
	char pad_0x1D90[0xC]; //0x1D90
	float b156_Z; //0x1D9C 
	char pad_0x1DA0[0xC]; //0x1DA0
	float b157_X; //0x1DAC 
	char pad_0x1DB0[0xC]; //0x1DB0
	float b157_Y; //0x1DBC 
	char pad_0x1DC0[0xC]; //0x1DC0
	float b157_Z; //0x1DCC 
	char pad_0x1DD0[0xC]; //0x1DD0
	float b158_X; //0x1DDC 
	char pad_0x1DE0[0xC]; //0x1DE0
	float b158_Y; //0x1DEC 
	char pad_0x1DF0[0xC]; //0x1DF0
	float b158_Z; //0x1DFC 
	char pad_0x1E00[0xC]; //0x1E00
	float b159_X; //0x1E0C 
	char pad_0x1E10[0xC]; //0x1E10
	float b159_Y; //0x1E1C 
	char pad_0x1E20[0xC]; //0x1E20
	float b159_Z; //0x1E2C 
	char pad_0x1E30[0x7FFC]; //0x1E30

}; //Size=0x9E2C

class healthptr1class
{
public:
	char pad_0x0000[0x18]; //0x0000
	healthptr2class* healthptr2; //0x0018 
	char pad_0x0020[0x868]; //0x0020

}; //Size=0x0888

class healthptr2class
{
public:
	char pad_0x0000[0x80]; //0x0000
	wchar_t entID[3]; //0x0080 
	char pad_0x0087[0xA9]; //0x0087
	__int32 health; //0x0130 
	char pad_0x0134[0x14]; //0x0134

}; //Size=0x0148








struct hookData
{
	char* pattern;
	BYTE originalJumpCode[32];
	uintptr_t* originalAddress;
	int overwrittenBytes;
	uintptr_t* hookAdress;

};

struct bonePoint {
	char info[99];
	Vector3 p1;
	Vector3 p2;
};

struct bone {
	char info[99];
	float* x;
	float* y;
	float* z;
};


struct boneNumber {
	char info[99];
	Vector3 p1;
};
